{
  "architectures": ["PulmonaryEmbolismSegmentationModel"],
  "auto_map": {
    "AutoConfig": "configuration_pe_segmentation.PulmonaryEmbolismSegmentationConfig",
    "AutoModel": "modeling_pe_segmentation.PulmonaryEmbolismSegmentationModel"
  },
  "model_type": "pulmonary-embolism-segmentation",
  "input_channels": 1,
  "num_labels": 2,
  "patch_size": [224, 320, 320],
  "spacing": [1.0, 0.7373045682907104, 0.7373045682907104],
  "features_per_stage": [32, 64, 128, 256, 320, 320, 320],
  "kernel_sizes": [[3, 3, 3], [3, 3, 3], [3, 3, 3], [3, 3, 3], [3, 3, 3], [3, 3, 3], [3, 3, 3]],
  "strides": [[1, 1, 1], [2, 2, 2], [2, 2, 2], [2, 2, 2], [2, 2, 2], [2, 2, 2], [1, 2, 2]],
  "n_blocks_per_stage": [1, 3, 4, 6, 6, 6, 6],
  "n_conv_per_stage_decoder": [1, 1, 1, 1, 1, 1],
  "conv_bias": true,
  "norm_eps": 1e-05,
  "norm_affine": true,
  "leaky_relu_inplace": true,
  "deep_supervision": false,
  "label2id": {
    "background": 0,
    "pulmonary_embolism": 1
  },
  "id2label": {
    "0": "background",
    "1": "pulmonary_embolism"
  },
  "ct_clip_min": -195.0,
  "ct_clip_max": 305.0,
  "ct_mean": 37.060203552246094,
  "ct_std": 92.34374237060547
}
